Tekla Open API Reference for Tekla Structures 2025
ModificationStamp.LocalStamp Property
 The modification stamp for the local changes.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int LocalStamp { get; set; }
Public Property LocalStamp As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ModificationStamp Class
Tekla.Structures.Model.History Namespace